doom/config.org
#+title: Config

* Doom settings
#+begin_src emacs-lisp
;; Projectile: use alien indexing (no caching, always fresh via fd/git)
(setq projectile-indexing-method 'alien)
(setq projectile-git-use-untracked-files t)

;; Tabs length
(setq-default indent-tabs-mode t)
(setq-default tab-width 4)

;; font
(setq doom-font (font-spec :family "JetBrains Mono" :size 14))
(custom-theme-set-faces!
  'doom-material
  '(org-level-8 :inherit outline-3 :height 1.0)
  '(org-level-7 :inherit outline-3 :height 1.0)
  '(org-level-6 :inherit outline-3 :height 1.1)
  '(org-level-5 :inherit outline-3 :height 1.2)
  '(org-level-4 :inherit outline-3 :height 1.3)
  '(org-level-3 :inherit outline-3 :height 1.4)
  '(org-level-2 :inherit outline-2 :height 1.5)
  '(org-level-1 :inherit outline-1 :height 1.6)
  '(org-document-title :height 1.8 :bold t :underline nil))
(setq doom-theme 'doom-material)

(setq display-line-numbers-type 'relative)

(map! :leader
      :desc "Comment line" "-" #'comment-line)

(setq org-directory "~/org/")
(setq mouse-wheel-follow-mouse 't) ;; scroll window under mouse

(setq confirm-kill-emacs nil)
;; (setq initial-buffer-choice )

(use-package! doom-themes
  :ensure t
  :custom
  ;; Global settings (defaults)
  (doom-themes-enable-bold t)   ; if nil, bold is universally disabled
  (doom-themes-enable-italic t) ; if nil, italics is universally disabled
  ;; for treemacs users
  (doom-themes-treemacs-theme "doom-atom") ; use "doom-colors" for less minimal icon theme
  :config
  ;; Enable flashing mode-line on errors
  (doom-themes-visual-bell-config)
  ;; Enable custom neotree theme (nerd-icons must be installed!)
  (doom-themes-neotree-config)
  ;; or for treemacs users
  (doom-themes-treemacs-config)
  ;; Corrects (and improves) org-mode's native fontification.
  (doom-themes-org-config))
#+end_src

* Ultra-scroll

Smooth pixel-precise scrolling that handles tall images and high-speed
trackpad/mouse input. Replaces =pixel-scroll-precision-mode=.

#+begin_src elisp
 (use-package! ultra-scroll
  :init
  (setq scroll-conservatively 3
        scroll-margin 0)
  :config
  (pixel-scroll-precision-mode 1)  ;; required for pixel-scroll-precision-interpolate
  (ultra-scroll-mode 1))
#+end_src

** Smooth keyboard scrolling (C-u / C-d)

=ultra-scroll= only handles mouse/trackpad input. For keyboard half-page
scrolling with =C-u= / =C-d=, bind directly to Evil's own scroll commands.
=pixel-scroll-precision-interpolate= is not available when =ultra-scroll=
replaces =pixel-scroll-precision-mode=.

#+begin_src elisp
(defun +custom/scroll-half-page-down ()
  "Smooth animated half-page scroll down."
  (interactive)
  (pixel-scroll-precision-interpolate (- (/ (window-body-height nil t) 2))))

(defun +custom/scroll-half-page-up ()
  "Smooth animated half-page scroll up."
  (interactive)
  (pixel-scroll-precision-interpolate (/ (window-body-height nil t) 2)))

(after! evil
  (define-key evil-normal-state-map (kbd "C-d") #'+custom/scroll-half-page-down)
  (define-key evil-normal-state-map (kbd "C-u") #'+custom/scroll-half-page-up)
  (define-key evil-visual-state-map (kbd "C-d") #'+custom/scroll-half-page-down)
  (define-key evil-visual-state-map (kbd "C-u") #'+custom/scroll-half-page-up))
#+end_src

* Bash version
#+begin_src emacs-lisp
(setq bash-completion-bash-executable "/opt/homebrew/bin/bash")
#+end_src

* Lookup Overrides

#+begin_src elisp
(map! :nv "gD" #'+lookup/references)
#+end_src

* IJKL Navigation Setup

This section remaps the core Vim movement keys from =hjkl= to the =ijkl=
"inverted-T" layout and carefully relocates all displaced keys.

** Keybinding Reference

| Key | Normal          | Visual          | Insert  | Operator          | Motion/Minibuf |
|-----+-----------------+-----------------+---------+-------------------+----------------|
| i   | Up              | Extend up       | type i  | (text obj: inner) | type i         |
| k   | Down            | Extend down     | type k  | (unchanged)       | type k         |
| j   | Left            | Extend left     | type j  | (unchanged)       | type j         |
| l   | Right           | Extend right    | type l  | (unchanged)       | type l         |
| ;   | Enter insert    | —               | type ;  | —                 | type ;         |
| :   | Insert at BOL   | —               | type :  | —                 | type :         |
| K   | Join lines      | Join lines      | —       | —                 | —              |
| u   | Undo            | Undo            | —       | —                 | —              |
| U   | Redo            | Redo            | —       | —                 | —              |
| M-; | Ex command      | Ex command      | —       | —                 | —              |

** Core Navigation (Normal, Visual)

Movement keys are bound in =normal= and =visual= states only.
- *Operator-pending* is excluded so text objects (=ciw=, =di(=, =yi"=) work.
- *Motion state* is excluded so minibuffer/M-x/Vertico typing works normally.

#+begin_src elisp
(after! evil
  (defun +custom/apply-ijkl-core-bindings ()

    ;; Core movement in normal + visual states.
    (define-key evil-normal-state-map (kbd "i") #'evil-previous-line)
    (define-key evil-normal-state-map (kbd "k") #'evil-next-line)
    (define-key evil-normal-state-map (kbd "j") #'evil-backward-char)
    (define-key evil-normal-state-map (kbd "l") #'evil-forward-char)
    (define-key evil-visual-state-map (kbd "i") #'evil-previous-line)
    (define-key evil-visual-state-map (kbd "k") #'evil-next-line)
    (define-key evil-visual-state-map (kbd "j") #'evil-backward-char)
    (define-key evil-visual-state-map (kbd "l") #'evil-forward-char)

    ;; Displaced keys.
    (define-key evil-normal-state-map (kbd ";") #'evil-insert)
    (define-key evil-normal-state-map (kbd ":") #'evil-insert-line)
    (define-key evil-normal-state-map (kbd "K") #'evil-join)
    (define-key evil-visual-state-map (kbd "K") #'evil-join)
    (define-key evil-normal-state-map (kbd "U") #'evil-redo)
    (define-key evil-visual-state-map (kbd "U") #'evil-redo)
    (define-key evil-normal-state-map (kbd "M-;") #'evil-ex)
    (define-key evil-visual-state-map (kbd "M-;") #'evil-ex))

  ;; Apply once now, then re-apply after Doom modules load to win precedence.
  (+custom/apply-ijkl-core-bindings)
  (add-hook 'doom-after-modules-config-hook #'+custom/apply-ijkl-core-bindings))
#+end_src

** Evil State For Dired and Magit

#+begin_src elisp
(after! evil
  ;; Keep Evil disabled in minibuffer/prompt UIs, but force normal-state Evil
  ;; in Dired buffers.
  (set-evil-initial-state! 'dired-mode 'normal)

  ;; Magit stays in Doom's default normal state (via evil-collection).
  ;; IJKL navigation is layered on top via normal-state bindings in the
  ;; Magit section below.

  (add-hook 'dired-mode-hook (lambda () (evil-local-mode 1))))
#+end_src

#+RESULTS:
| doom--recentf-add-dired-directory-h | +dired-disable-gnu-ls-flags-maybe-h | #[nil ((evil-local-mode 1)) nil] | dired-omit-mode | diredfl-mode | +vc-gutter-enable-maybe-h |

** Window Management (SPC w / C-w)

Doom binds =SPC w= to =evil-window-map= by default, which contains all the
standard window operations (split, close, resize, rotate, etc.). We add our
ijkl navigation directly into that existing map so nothing is lost.

#+begin_src elisp
(defun +custom/window-top-right ()
  "Select the top-right window in the current frame."
  (interactive)
  (let ((best (selected-window))
        (best-right -1))
    (walk-windows
     (lambda (w)
       (let ((edges (window-edges w)))
         (when (and (= (nth 1 edges) 0)            ;; top row
                    (> (nth 2 edges) best-right))   ;; rightmost
           (setq best-right (nth 2 edges)
                 best w))))
     nil (selected-frame))
    (select-window best)))

(map! :map evil-window-map
      "i" #'evil-window-up
      "k" #'evil-window-down
      "j" #'evil-window-left
      "l" #'evil-window-right
      "I" #'+evil/window-move-up
      "K" #'+evil/window-move-down
      "J" #'+evil/window-move-left
      "L" #'+evil/window-move-right
      "t" #'+custom/window-top-right)
#+end_src

** Module-Specific Fixes

Evil-collection often forces =hjkl= in special buffers. These hooks ensure
your ijkl layout persists in the most common tools.

*** Magit

Magit buffers stay in Evil normal state (Doom's default via evil-collection).
We overlay IJKL navigation in normal state so it coexists with all the
standard evil-collection-magit bindings (=gr= refresh, =s= stage, =c= commit,
=f= fetch, =F= pull, =[= / =]= sibling nav, etc.).

#+begin_src elisp
(after! magit
  (setq magit-branch-read-upstream-first 'fallback)
  (map! :map magit-mode-map
        :n "i" #'magit-section-backward
        :n "k" #'magit-section-forward
        :n "j" #'magit-section-backward-sibling
        :n "l" #'magit-section-forward-sibling
        :n ";" #'magit-section-toggle))
#+end_src

*** Dired

#+begin_src elisp
(after! dired
  (map! :map dired-mode-map
        :nv "i" #'dired-previous-line
        :nv "k" #'dired-next-line
        :nv "j" #'dired-up-directory
        :nv "l" #'dired-find-file))
#+end_src

*** Treemacs

Treemacs uses a custom =treemacs= evil state (not =normal=), so the global ijkl
remapping doesn't reach it. We bind directly into =evil-treemacs-state-map=.

#+begin_src elisp
(after! treemacs
  (map! :map evil-treemacs-state-map
        "i" #'treemacs-previous-line
        "k" #'treemacs-next-line
        "j" #'treemacs-root-up
        "l" #'treemacs-RET-action
        ";" #'treemacs-COLLAPSE-action))
#+end_src

