doom/config.org
*** Vterm
#+begin_src elisp
(defun +vterm-no-autoscroll-a (orig-fn &rest args)
  "Only scroll to bottom if the window is already showing it."
  (let ((win (get-buffer-window (current-buffer))))
    (when (and win
               (>= (window-end win t)
                   (- (point-max) 1)))
      (apply orig-fn args))))

(after! vterm
  (setq vterm-scroll-to-bottom-on-output nil)
  (advice-add #'vterm--set-window-point :around #'+vterm-no-autoscroll-a)
  (add-hook 'vterm-mode-hook
    (lambda ()
      (setq-local vterm-scroll-to-bottom-on-output nil)
      (setq-local scroll-conservatively 101)))
  (evil-define-key 'insert vterm-mode-map
    (kbd "C-r") #'vterm--self-insert)
  (map! :map vterm-mode-map
        :nv "i" #'evil-previous-line
        :nv "k" #'evil-next-line
        :nv "j" #'evil-backward-char
        :nv "l" #'evil-forward-char
        :nv ";" #'evil-insert))
#+end_src
*** Org Mode (evil-org)

=evil-org= adds text-object bindings on =i= in visual state (inner-object,
inner-element, etc.) which override our global ijkl movement. We force ijkl
back onto the =evil-org-mode-map= so Org buffers stay consistent.

#+begin_src elisp
(after! evil-org
  ;; evil-org binds i-prefixed text objects (ie, ip, iR…) in normal state,
  ;; which conflicts with our i=up remap. Remove those normal-state bindings
  ;; so i can stay a plain key, then re-assert IJKL in normal+visual.
  (evil-define-key 'normal evil-org-mode-map
    (kbd "i") nil)
  (map! :map evil-org-mode-map
        :n "i" #'evil-previous-line
        :n "k" #'evil-next-line
        :n "j" #'evil-backward-char
        :n "l" #'evil-forward-char
        :v "i" #'evil-previous-line
        :v "k" #'evil-next-line
        :v "j" #'evil-backward-char
        :v "l" #'evil-forward-char))
#+end_src

* Eglot: Keep JSON files in json-mode

Doom's tree-sitter module remaps =json-mode= to =json-ts-mode=.  Override via
=major-mode-remap-alist= so =.json= files stay in plain =json-mode=.

Even with the mode fixed, Doom's =:lang javascript= module configures eglot to
attach =typescript-language-server= to =json-mode= buffers, producing bogus
=; expected= diagnostics.  Explicitly reassign =json-mode= in
=eglot-server-programs= to =vscode-json-language-server= so the correct server
is used.  Requires =vscode-json-language-server= (=npm i -g vscode-langservers-extracted=).

#+begin_src elisp
(add-to-list 'major-mode-remap-alist '(json-ts-mode . json-mode))

(after! eglot
  (set-eglot-client! '(json-mode json-ts-mode)
    '("vscode-json-language-server" "--stdio")))
#+end_src

* Linting and Formatting (Biome / Prettier auto-detection)

When a project contains =biome.json=, use Biome for formatting and linting.
Otherwise fall back to Apheleia's default (Prettier).  This means you never
need to change your config when switching between projects.

** Dynamic formatter selection (Apheleia)

The buffer-local =apheleia-formatter= (aliased to =+format-with= in Doom) is
checked *first* by Apheleia, before the mode-alist.  Setting it in a mode hook
gives us per-project formatter selection without touching global state.

#+begin_src elisp
(defun +detect-project-formatter-h ()
  "Set buffer-local formatter to biome when biome.json is found in the project."
  (when (locate-dominating-file default-directory "biome.json")
    (setq-local apheleia-formatter 'biome)))

(add-hook 'typescript-ts-mode-hook #'+detect-project-formatter-h)
(add-hook 'tsx-ts-mode-hook        #'+detect-project-formatter-h)
(add-hook 'js-ts-mode-hook         #'+detect-project-formatter-h)
(add-hook 'json-ts-mode-hook       #'+detect-project-formatter-h)
(add-hook 'jsonc-mode-hook         #'+detect-project-formatter-h)
#+end_src

** Flycheck checker for Biome

Runs =biome check= and parses the default text output.  The =:predicate= ensures
it only activates when =biome.json= exists, so Prettier-only projects are
unaffected.  Chained after the =eglot-check= checker so you get both tsserver
type diagnostics and Biome lint warnings inline.

#+begin_src elisp
;; (after! flycheck
;;   (flycheck-define-checker biome-check
;;     "A syntax checker using Biome (biomejs.dev)."
;;     :command ("biome" "check" "--colors=off"
;;               source-original)
;;     :error-patterns
;;     ((warning line-start (file-name) ":" line ":" column " "
;;               (id (one-or-more (not (any " " "\t")))) (zero-or-more not-newline) "\n"
;;               "\n"
;;               "  ! " (message (one-or-more not-newline)) line-end)
;;      (error line-start (file-name) ":" line ":" column " "
;;             "parse" (zero-or-more not-newline) "\n"
;;             "\n"
;;             "  × " (message (one-or-more not-newline)) line-end))
;;     :modes (typescript-ts-mode tsx-ts-mode js-ts-mode json-ts-mode jsonc-mode)
;;     :predicate (lambda () (locate-dominating-file default-directory "biome.json")))

;;   (add-to-list 'flycheck-checkers 'biome-check)
;;   (flycheck-add-next-checker 'eglot-check '(warning . biome-check)))
#+end_src

* Custom functons

*** Open vterm in a window instead of the popup that doom emacs does

#+begin_src elisp
(defun my/vterm-bottom ()
  (interactive)
  (let ((window (split-window (frame-root-window) -15 'below))
        (dir (or (doom-project-root) default-directory)))
    (select-window window)
    (+vterm/here dir)))

(map! :leader
      :desc "vterm bottom"
      "o t" #'my/vterm-bottom)
#+end_src

