doom/config.el

(defun +vterm-no-autoscroll-a (orig-fn &rest args)
  "Only scroll to bottom if the window is already showing it."
  (let ((win (get-buffer-window (current-buffer))))
    (when (and win
               (>= (window-end win t)
                   (- (point-max) 1)))
      (apply orig-fn args))))

(after! vterm
  (setq vterm-scroll-to-bottom-on-output nil)
  (advice-add #'vterm--set-window-point :around #'+vterm-no-autoscroll-a)
  (add-hook 'vterm-mode-hook
    (lambda ()
      (setq-local vterm-scroll-to-bottom-on-output nil)
      (setq-local scroll-conservatively 101)))
  (evil-define-key 'insert vterm-mode-map
    (kbd "C-r") #'vterm--self-insert)
  (map! :map vterm-mode-map
        :nv "i" #'evil-previous-line
        :nv "k" #'evil-next-line
        :nv "j" #'evil-backward-char
        :nv "l" #'evil-forward-char
        :nv ";" #'evil-insert))

(after! evil-org
  ;; evil-org binds i-prefixed text objects (ie, ip, iR…) in normal state,
  ;; which conflicts with our i=up remap. Remove those normal-state bindings
  ;; so i can stay a plain key, then re-assert IJKL in normal+visual.
  (evil-define-key 'normal evil-org-mode-map
    (kbd "i") nil)
  (map! :map evil-org-mode-map
        :n "i" #'evil-previous-line
        :n "k" #'evil-next-line
        :n "j" #'evil-backward-char
        :n "l" #'evil-forward-char
        :v "i" #'evil-previous-line
        :v "k" #'evil-next-line
        :v "j" #'evil-backward-char
        :v "l" #'evil-forward-char))

(add-to-list 'major-mode-remap-alist '(json-ts-mode . json-mode))

(after! eglot
  (set-eglot-client! '(json-mode json-ts-mode)
    '("vscode-json-language-server" "--stdio")))

(defun +detect-project-formatter-h ()
  "Set buffer-local formatter to biome when biome.json is found in the project."
  (when (locate-dominating-file default-directory "biome.json")
    (setq-local apheleia-formatter 'biome)))

(add-hook 'typescript-ts-mode-hook #'+detect-project-formatter-h)
(add-hook 'tsx-ts-mode-hook        #'+detect-project-formatter-h)
(add-hook 'js-ts-mode-hook         #'+detect-project-formatter-h)
(add-hook 'json-ts-mode-hook       #'+detect-project-formatter-h)
(add-hook 'jsonc-mode-hook         #'+detect-project-formatter-h)

;; (after! flycheck
;;   (flycheck-define-checker biome-check
;;     "A syntax checker using Biome (biomejs.dev)."
;;     :command ("biome" "check" "--colors=off"
;;               source-original)
;;     :error-patterns
;;     ((warning line-start (file-name) ":" line ":" column " "
;;               (id (one-or-more (not (any " " "\t")))) (zero-or-more not-newline) "\n"
;;               "\n"
;;               "  ! " (message (one-or-more not-newline)) line-end)
;;      (error line-start (file-name) ":" line ":" column " "
;;             "parse" (zero-or-more not-newline) "\n"
;;             "\n"
;;             "  × " (message (one-or-more not-newline)) line-end))
;;     :modes (typescript-ts-mode tsx-ts-mode js-ts-mode json-ts-mode jsonc-mode)
;;     :predicate (lambda () (locate-dominating-file default-directory "biome.json")))

;;   (add-to-list 'flycheck-checkers 'biome-check)
;;   (flycheck-add-next-checker 'eglot-check '(warning . biome-check)))

(defun my/vterm-bottom ()
  (interactive)
  (let ((window (split-window (frame-root-window) -15 'below))
        (dir (or (doom-project-root) default-directory)))
    (select-window window)
    (+vterm/here dir)))

(map! :leader
      :desc "vterm bottom"
      "o t" #'my/vterm-bottom)
